<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
  <key>Description</key>
  <string>Downloads the latest FontAgent Pro 6 installer and imports the .pkg into Munki. Also includes Smasher.</string>
  <key>Identifier</key>
  <string>com.github.zachtarr.FontAgentPro6.munki</string>
  <key>Input</key>
  <dict>
    <key>NAME</key>
    <string>FontAgentPro6</string>
    <key>MUNKI_REPO_SUBDIR</key>
    <string>apps</string>
    <key>pkginfo</key>
    <dict>
      <key>catalogs</key>
      <array>
        <string>testing</string>
      </array>
      <key>description</key>
      <string>Font management application. Also includes Smasher.</string>
      <key>display_name</key>
      <string>FontAgent Pro 6</string>
      <key>name</key>
      <string>%NAME%</string>
      <key>unattended_install</key>
      <true/>
      <key>minimum_os_version</key>
      <string>10.7.0</string>
      <key>developer</key>
      <string>Insider Software</string>
      <key>category</key>
      <string>Design</string>
      <key>supported_architectures</key>
        <array>
          <string>i386</string>
          <string>x86_64</string>
        </array>
    </dict>
  </dict>
  <key>MinimumVersion</key>
  <string>0.2.0</string>
  <key>ParentRecipe</key>
  <string>com.github.zachtarr.download.FontAgentPro6</string>
  <key>Process</key>
  <array>
    <dict>
      <key>Arguments</key>
        <dict>
          <key>pkg_path</key>
          <string>%pathname%</string>
          <key>repo_subdirectory</key>
          <string>%MUNKI_REPO_SUBDIR%</string>
        </dict>
      <key>Processor</key>
      <string>MunkiImporter</string>
    </dict>
  </array>
</dict>
</plist>
